
#
# input
#
read_verilog SevenSegmentDecoder.v

#
# synthesis
#
synth -top SevenSegmentDecoder -run begin:fine
opt -fast -full
memory_map
opt -full
techmap
opt -full
abc
opt -full
synth -run check:

#
# tech mapping
#
dfflibmap -liberty own.lib
abc -liberty own.lib -nocleanup
clean
stat -liberty own.lib

#
# output
#
write_verilog out.v
read_liberty -lib own.lib
show -format svg -prefix show
